In [ ]:
"""
Given a table

drop table if exists actor;
CREATE TABLE actor (
   actor_id  smallint(5)  NOT NULL PRIMARY KEY,
   first_name  varchar(45) NOT NULL,
   last_name  varchar(45) NOT NULL,
   last_update  DATETIME NOT NULL)
   
Insert the following data (there can't be 2 insert queries)
1	PENELOPE	GUINESS	2006-02-15 12:34:33
2	NICK	WAHLBERG	2006-02-15 12:34:33

"""

In [ ]:
"""SQL solution"""
INSERT INTO actor
VALUES
(1, 'PENELOPE', 'GUINESS', '2006-02-15 12:34:33'),
(2, 'NICK', 'WAHLBERG', '2006-02-15 12:34:33')

In [1]:
"""pandas daataframe creation"""
import pandas as pd

actor = pd.DataFrame(columns=['actor_id', 'first_name', 'last_name', 'last_update'])
actor

Empty DataFrame
Columns: [actor_id, first_name, last_name, last_update]
Index: []

In [6]:
# concat the existing dataframe and the new dataframe with data to be inserted
df = pd.DataFrame([[1,'PENELOPE', 'GUINESS', '2006-02-15 12:34:33'],
                   [2, 'NICK', 'WAHLBERG', '2006-02-15 12:34:33']],
                  columns=['actor_id', 'first_name', 'last_name', 'last_update'])
actor = pd.concat([actor, df])
actor

  actor_id first_name last_name          last_update
0        1   PENELOPE   GUINESS  2006-02-15 12:34:33
1        2       NICK  WAHLBERG  2006-02-15 12:34:33

In [10]:
# insert row by row at the end of the existing dataframe (or any locatioin given by loc)
actor = pd.DataFrame(columns=['actor_id', 'first_name', 'last_name', 'last_update'])
new_data = [[1,'PENELOPE', 'GUINESS', '2006-02-15 12:34:33'],
            [2, 'NICK', 'WAHLBERG', '2006-02-15 12:34:33']]
for i in range(len(new_data)):
    actor.loc[len(actor)] = new_data[i] # add the new row at loc len(actor), which is below the last row of the current dataframe
actor

  actor_id first_name last_name          last_update
0        1   PENELOPE   GUINESS  2006-02-15 12:34:33
1        2       NICK  WAHLBERG  2006-02-15 12:34:33